/*
 * music.c
 *
 *  Created on: May 22, 2023
 *      Author: Rd
 */

#include "music.h"
//                		低7  1   2   3   4   5   6   7  高1  高2  高3 高4  高5  不发音
const uint16_t tone[]={247,262,294,330,349,392,440,294,523,587,659,698,784,1000};//音频数据表

const uint8_t music1[]={5,5,6,8,7,6,5,6,13,13,//音调
        5,5,6,8,7,6,5,3,13,13,
        2,2,3,5,3,5,6,3,2,1,
        6,6,5,6,5,3,6,5,13,13,

        5,5,6,8,7,6,5,6,13,13,
        5,5,6,8,7,6,5,3,13,13,
        2,2,3,5,3,5,6,3,2,1,
        6,6,5,6,5,3,6,1,

        13,8,9,10,10,9,8,10,9,8,6,
        13,6,8,9,9,8,6,9,8,6,5,
        13,2,3,5,5,3,5,5,6,8,7,6,
        6,10,9,9,8,6,5,6,8};

const uint8_t time1[]={2,4,2,2,2,2,2,8,4, 4, //时间
        2,4,2,2,2,2,2,8,4, 4,
        2,4,2,4,2,2,4,2,2,8,
        2,4,2,2,2,2,2,8,4 ,4,

        2,4,2,2,2,2,2,8,4, 4,
        2,4,2,2,2,2,2,8,4, 4,
        2,4,2,4,2,2,4,2,2,8,
        2,4,2,2,2,2,2,8,

        4, 2,2,2, 4, 2,2,2, 2,2,8,
        4, 2,2,2,4,2,2,2,2,2,8,
        4, 2,2,2,4,2,2,5,2,6,2,4,
        2,2 ,2,4,2,4,2,2,12
};
void BEEPH(void){
	HAL_GPIO_WritePin(GPIOB, GPIO_PIN_7, 1);
}

void BEEPL(void){
	HAL_GPIO_WritePin(GPIOB, GPIO_PIN_7, 0);
}


void music_import(const uint8_t* music,const uint8_t* time){
	for(uint16_t i=0;i<(sizeof(*music)/sizeof(music[0]));i++)
		for(uint16_t j=0;j<((uint16_t)time[i]*tone[music[i]]);j++)
		{
			BEEPH();
			uint32_t us=500000/tone[music[i]];
			Delay_us(us);
			BEEPL();
			Delay_us(us);
		}
}

